<template>
  <smart-widget title="剧情人物关系变化图" :loading="loading">
    <MainChart v-bind:sdata="SankeyData" :edata="EpisodeData" ref="main_chart" :loading="loading" />
    <!--<Sankey ref="sankey"/>-->
  </smart-widget>
</template>

<script>
import MainChart from "./MainChart";
import _ from "lodash";
export default {
  name: "MainChartBox",
  props: {
    EpisodeData: {
      type: Number,
      required: true
    },
    SankeyData: {
      type: Object,
      required: true
    },
    loading: {
      default: true
    }
  },
  data: function() {
    return {
      /*
            数据格式：
            EpisodeData:总集数
            SankeyData:{
                '1'：和FPS01_E01.json文件相同
                '2'：FPS01_E02.json文件
                ...
            }
            */
      /*
            EpisodeData:7,
            SankeyData:{
                1:[[[["方圆"], 4], [["童文洁"], 10], [["方一凡"], 14], [["校长"], 4], [["李萌"], 9], [["季杨杨"], 17], [["保安"], 4], [["黄芷陶"], 2], [["刘静"], 13], [["季胜利"], 6], [["刘铮"], 7], [["宋倩"], 5], [["乔英子"], 1], [["乔卫东"], 2]], [[["方圆", "童文洁"], 3], [["方一凡", "方圆"], 2], [["方一凡", "童文洁"], 5], [["李萌", "校长"], 1], [["季杨杨", "方一凡"], 9], [["季杨杨", "李萌"], 5], [["方一凡", "李萌"], 5], [["保安", "季杨杨"], 4], [["季杨杨", "黄芷陶"], 2], [["方一凡", "黄芷陶"], 2], [["刘静", "季杨杨"], 4], [["刘静", "李萌"], 3], [["刘静", "童文洁"], 3], [["季杨杨", "童文洁"], 1], [["李萌", "童文洁"], 4], [["刘静", "季胜利"], 4], [["季杨杨", "季胜利"], 1], [["刘铮", "刘静"], 5], [["刘铮", "季杨杨"], 2], [["刘铮", "季胜利"], 2], [["刘静", "宋倩"], 2], [["乔英子", "宋倩"], 1], [["乔卫东", "宋倩"], 2]], [[["方一凡", "方圆", "童文洁"], 2], [["季杨杨", "方一凡", "李萌"], 4], [["季杨杨", "方一凡", "黄芷陶"], 2], [["刘静", "季杨杨", "李萌"], 1], [["刘静", "季杨杨", "童文洁"], 1], [["刘静", "李萌", "童文洁"], 3], [["季杨杨", "李萌", "童文洁"], 1], [["方一凡", "李萌", "童文洁"], 1], [["刘静", "季杨杨", "季胜利"], 1], [["刘铮", "刘静", "季杨杨"], 2], [["刘铮", "刘静", "季胜利"], 2]], [[["刘静", "季杨杨", "李萌", "童文洁"], 1]]],
                2:[[[["乔卫东"], 15], [["乔英子"], 12], [["宋倩"], 16], [["保安"], 3], [["方一凡"], 13], [["童文洁"], 10], [["方圆"], 7], [["刘静"], 9], [["季杨杨"], 6], [["刘静母亲"], 1], [["季胜利"], 9], [["刘铮"], 1], [["黄芷陶"], 3], [["校长"], 3]], [[["乔卫东", "乔英子"], 7], [["乔卫东", "宋倩"], 8], [["乔英子", "宋倩"], 8], [["乔卫东", "保安"], 3], [["保安", "宋倩"], 1], [["宋倩", "方一凡"], 3], [["宋倩", "童文洁"], 5], [["方一凡", "童文洁"], 4], [["乔英子", "方一凡"], 2], [["乔卫东", "童文洁"], 3], [["乔英子", "童文洁"], 1], [["乔卫东", "方一凡"], 1], [["乔卫东", "方圆"], 3], [["方圆", "童文洁"], 5], [["宋倩", "方圆"], 2], [["刘静", "季杨杨"], 4], [["刘静母亲", "季杨杨"], 1], [["刘静母亲", "季胜利"], 1], [["季杨杨", "季胜利"], 3], [["刘铮", "刘静"], 1], [["刘铮", "季杨杨"], 1], [["刘铮", "季胜利"], 1], [["刘静", "季胜利"], 5], [["方一凡", "方圆"], 2], [["方一凡", "黄芷陶"], 2], [["乔卫东", "刘静"], 1], [["乔卫东", "季胜利"], 1], [["刘静", "宋倩"], 1], [["刘静", "方圆"], 1], [["刘静", "童文洁"], 1], [["季胜利", "宋倩"], 1], [["季胜利", "方圆"], 2], [["季胜利", "童文洁"], 2], [["季胜利", "校长"], 1], [["方一凡", "校长"], 1]], [[["乔卫东", "乔英子", "宋倩"], 4], [["乔卫东", "保安", "宋倩"], 1], [["宋倩", "方一凡", "童文洁"], 3], [["乔卫东", "乔英子", "童文洁"], 1], [["乔卫东", "宋倩", "童文洁"], 2], [["乔英子", "宋倩", "童文洁"], 1], [["乔卫东", "乔英子", "方一凡"], 1], [["乔卫东", "方圆", "童文洁"], 2], [["乔卫东", "宋倩", "方圆"], 2], [["刘静母亲", "季杨杨", "季胜利"], 1], [["刘铮", "刘静", "季杨杨"], 1], [["刘铮", "刘静", "季胜利"], 1], [["刘铮", "季杨杨", "季胜利"], 1], [["刘静", "季杨杨", "季胜利"], 1], [["方一凡", "方圆", "童文洁"], 1], [["乔卫东", "刘静", "季胜利"], 1], [["乔卫东", "刘静", "宋倩"], 1], [["乔卫东", "刘静", "方圆"], 1], [["乔卫东", "刘静", "童文洁"], 1], [["乔卫东", "季胜利", "宋倩"], 1], [["乔卫东", "季胜利", "方圆"], 1], [["乔卫东", "季胜利", "童文洁"], 1], [["刘静", "季胜利", "宋倩"], 1], [["刘静", "季胜利", "方圆"], 1], [["刘静", "季胜利", "童文洁"], 1], [["刘静", "宋倩", "方圆"], 1], [["刘静", "宋倩", "童文洁"], 1], [["刘静", "方圆", "童文洁"], 1], [["季胜利", "宋倩", "方圆"], 1], [["季胜利", "宋倩", "童文洁"], 1], [["季胜利", "方圆", "童文洁"], 2], [["宋倩", "方圆", "童文洁"], 1]], [[["乔卫东", "乔英子", "宋倩", "童文洁"], 1], [["刘铮", "刘静", "季杨杨", "季胜利"], 1], [["乔卫东", "刘静", "季胜利", "宋倩"], 1], [["乔卫东", "刘静", "季胜利", "方圆"], 1], [["乔卫东", "刘静", "季胜利", "童文洁"], 1], [["乔卫东", "刘静", "宋倩", "方圆"], 1], [["乔卫东", "刘静", "宋倩", "童文洁"], 1], [["乔卫东", "刘静", "方圆", "童文洁"], 1], [["乔卫东", "季胜利", "宋倩", "方圆"], 1], [["乔卫东", "季胜利", "宋倩", "童文洁"], 1], [["乔卫东", "季胜利", "方圆", "童文洁"], 1], [["乔卫东", "宋倩", "方圆", "童文洁"], 1], [["刘静", "季胜利", "宋倩", "方圆"], 1], [["刘静", "季胜利", "宋倩", "童文洁"], 1], [["刘静", "季胜利", "方圆", "童文洁"], 1], [["刘静", "宋倩", "方圆", "童文洁"], 1], [["季胜利", "宋倩", "方圆", "童文洁"], 1]], [[["乔卫东", "刘静", "季胜利", "宋倩", "方圆"], 1], [["乔卫东", "刘静", "季胜利", "宋倩", "童文洁"], 1], [["乔卫东", "刘静", "季胜利", "方圆", "童文洁"], 1], [["乔卫东", "刘静", "宋倩", "方圆", "童文洁"], 1], [["乔卫东", "季胜利", "宋倩", "方圆", "童文洁"], 1], [["刘静", "季胜利", "宋倩", "方圆", "童文洁"], 1]], [[["乔卫东", "刘静", "季胜利", "宋倩", "方圆", "童文洁"], 1]]],
                3:[[[["方圆"], 15], [["方一凡"], 15], [["童文洁"], 11], [["李萌"], 6], [["乔英子"], 8], [["季胜利"], 10], [["校长"], 2], [["乔卫东"], 4], [["宋倩"], 6], [["刘铮"], 6], [["季杨杨"], 8], [["刘静"], 4], [["黄芷陶"], 1]], [[["方一凡", "方圆"], 6], [["方一凡", "童文洁"], 4], [["方圆", "童文洁"], 6], [["方一凡", "李萌"], 5], [["乔英子", "方一凡"], 2], [["乔英子", "方圆"], 1], [["方圆", "李萌"], 1], [["季胜利", "方圆"], 8], [["季胜利", "校长"], 2], [["方圆", "校长"], 2], [["季胜利", "童文洁"], 5], [["乔卫东", "乔英子"], 2], [["乔卫东", "宋倩"], 3], [["乔英子", "宋倩"], 5], [["刘铮", "季杨杨"], 6], [["刘铮", "刘静"], 2], [["刘静", "季杨杨"], 3], [["刘铮", "季胜利"], 1], [["刘静", "季胜利"], 3], [["季杨杨", "季胜利"], 2], [["李萌", "童文洁"], 3], [["刘静", "方圆"], 1], [["刘静", "童文洁"], 2], [["季杨杨", "童文洁"], 1], [["乔英子", "黄芷陶"], 1], [["方一凡", "黄芷陶"], 1]], [[["方一凡", "方圆", "童文洁"], 1], [["乔英子", "方一凡", "方圆"], 1], [["方一凡", "方圆", "李萌"], 1], [["季胜利", "方圆", "校长"], 2], [["季胜利", "方圆", "童文洁"], 4], [["乔卫东", "乔英子", "宋倩"], 2], [["刘铮", "刘静", "季杨杨"], 2], [["刘铮", "刘静", "季胜利"], 1], [["刘铮", "季杨杨", "季胜利"], 1], [["刘静", "季杨杨", "季胜利"], 2], [["方一凡", "李萌", "童文洁"], 2], [["刘静", "季胜利", "方圆"], 1], [["刘静", "季胜利", "童文洁"], 2], [["刘静", "方圆", "童文洁"], 1], [["刘静", "季杨杨", "童文洁"], 1], [["季杨杨", "季胜利", "童文洁"], 1], [["乔英子", "方一凡", "黄芷陶"], 1]], [[["刘铮", "刘静", "季杨杨", "季胜利"], 1], [["刘静", "季胜利", "方圆", "童文洁"], 1], [["刘静", "季杨杨", "季胜利", "童文洁"], 1]]],
                4:[[[["方一凡"], 14], [["童文洁"], 18], [["方圆"], 9], [["林磊儿"], 11], [["刘静"], 12], [["季杨杨"], 9], [["刘铮"], 1], [["季胜利"], 9], [["方圆母亲"], 5], [["乔英子"], 4], [["宋倩"], 4]], [[["方一凡", "童文洁"], 11], [["方圆", "童文洁"], 7], [["林磊儿", "童文洁"], 8], [["方一凡", "方圆"], 5], [["刘静", "季杨杨"], 8], [["刘铮", "刘静"], 1], [["刘铮", "季杨杨"], 1], [["刘静", "季胜利"], 7], [["季杨杨", "季胜利"], 5], [["方一凡", "林磊儿"], 5], [["方圆", "林磊儿"], 4], [["方一凡", "方圆母亲"], 1], [["方圆", "方圆母亲"], 2], [["方圆母亲", "林磊儿"], 1], [["方圆母亲", "童文洁"], 3], [["乔英子", "宋倩"], 4]], [[["方一凡", "方圆", "童文洁"], 5], [["刘铮", "刘静", "季杨杨"], 1], [["刘静", "季杨杨", "季胜利"], 4], [["方一凡", "方圆", "林磊儿"], 2], [["方一凡", "林磊儿", "童文洁"], 5], [["方圆", "林磊儿", "童文洁"], 2], [["方一凡", "方圆", "方圆母亲"], 1], [["方一凡", "方圆母亲", "林磊儿"], 1], [["方一凡", "方圆母亲", "童文洁"], 1], [["方圆", "方圆母亲", "林磊儿"], 1], [["方圆", "方圆母亲", "童文洁"], 2], [["方圆母亲", "林磊儿", "童文洁"], 1]], [[["方一凡", "方圆", "林磊儿", "童文洁"], 2], [["方一凡", "方圆", "方圆母亲", "林磊儿"], 1], [["方一凡", "方圆", "方圆母亲", "童文洁"], 1], [["方一凡", "方圆母亲", "林磊儿", "童文洁"], 1], [["方圆", "方圆母亲", "林磊儿", "童文洁"], 1]], [[["方一凡", "方圆", "方圆母亲", "林磊儿", "童文洁"], 1]]],
                5:[[[["\u65b9\u5706"], 7], [["\u6797\u78ca\u513f"], 13], [["\u65b9\u4e00\u51e1"], 6], [["\u7ae5\u6587\u6d01"], 9], [["\u65b9\u5706\u6bcd\u4eb2"], 1], [["\u5218\u94ee"], 5], [["\u5b63\u6768\u6768"], 16], [["\u5218\u9759"], 11], [["\u5b63\u80dc\u5229"], 14], [["\u4e54\u82f1\u5b50"], 4], [["\u5b8b\u5029"], 3]], [[["\u65b9\u5706", "\u6797\u78ca\u513f"], 4], [["\u65b9\u4e00\u51e1", "\u6797\u78ca\u513f"], 6], [["\u65b9\u5706", "\u7ae5\u6587\u6d01"], 5], [["\u6797\u78ca\u513f", "\u7ae5\u6587\u6d01"], 5], [["\u65b9\u5706", "\u65b9\u5706\u6bcd\u4eb2"], 1], [["\u65b9\u5706\u6bcd\u4eb2", "\u7ae5\u6587\u6d01"], 1], [["\u65b9\u4e00\u51e1", "\u7ae5\u6587\u6d01"], 3], [["\u5218\u94ee", "\u5b63\u6768\u6768"], 4], [["\u5218\u94ee", "\u5218\u9759"], 2], [["\u5218\u94ee", "\u5b63\u80dc\u5229"], 3], [["\u5218\u9759", "\u5b63\u6768\u6768"], 8], [["\u5218\u9759", "\u5b63\u80dc\u5229"], 10], [["\u5b63\u6768\u6768", "\u5b63\u80dc\u5229"], 12], [["\u4e54\u82f1\u5b50", "\u5b8b\u5029"], 3], [["\u4e54\u82f1\u5b50", "\u6797\u78ca\u513f"], 1]], [[["\u65b9\u5706", "\u6797\u78ca\u513f", "\u7ae5\u6587\u6d01"], 2], [["\u65b9\u5706", "\u65b9\u5706\u6bcd\u4eb2", "\u7ae5\u6587\u6d01"], 1], [["\u65b9\u4e00\u51e1", "\u6797\u78ca\u513f", "\u7ae5\u6587\u6d01"], 3], [["\u5218\u94ee", "\u5218\u9759", "\u5b63\u6768\u6768"], 1], [["\u5218\u94ee", "\u5218\u9759", "\u5b63\u80dc\u5229"], 1], [["\u5218\u94ee", "\u5b63\u6768\u6768", "\u5b63\u80dc\u5229"], 3], [["\u5218\u9759", "\u5b63\u6768\u6768", "\u5b63\u80dc\u5229"], 8]], [[["\u5218\u94ee", "\u5218\u9759", "\u5b63\u6768\u6768", "\u5b63\u80dc\u5229"], 1]]],
                6:[[[["\u4e54\u82f1\u5b50"], 3], [["\u6797\u78ca\u513f"], 8], [["\u674e\u840c"], 8], [["\u5b63\u6768\u6768"], 7], [["\u6f58\u8001\u5e08"], 1], [["\u52a9\u7406"], 2], [["\u73cd\u59ae"], 4], [["\u7ae5\u6587\u6d01"], 11], [["\u65b9\u4e00\u51e1"], 4], [["\u5b8b\u5029"], 10], [["\u65b9\u5706"], 7], [["\u4e54\u536b\u4e1c"], 3], [["\u5218\u9759"], 2], [["\u5b63\u80dc\u5229"], 6]], [[["\u4e54\u82f1\u5b50", "\u6797\u78ca\u513f"], 1], [["\u674e\u840c", "\u6797\u78ca\u513f"], 4], [["\u5b63\u6768\u6768", "\u6f58\u8001\u5e08"], 1], [["\u52a9\u7406", "\u73cd\u59ae"], 2], [["\u52a9\u7406", "\u7ae5\u6587\u6d01"], 2], [["\u73cd\u59ae", "\u7ae5\u6587\u6d01"], 4], [["\u65b9\u4e00\u51e1", "\u674e\u840c"], 1], [["\u5b8b\u5029", "\u65b9\u5706"], 7], [["\u4e54\u536b\u4e1c", "\u4e54\u82f1\u5b50"], 1], [["\u4e54\u536b\u4e1c", "\u5b8b\u5029"], 3], [["\u4e54\u536b\u4e1c", "\u65b9\u5706"], 1], [["\u4e54\u82f1\u5b50", "\u5b8b\u5029"], 1], [["\u4e54\u82f1\u5b50", "\u65b9\u5706"], 1], [["\u5b8b\u5029", "\u65b9\u4e00\u51e1"], 1], [["\u5b8b\u5029", "\u6797\u78ca\u513f"], 1], [["\u5b8b\u5029", "\u7ae5\u6587\u6d01"], 3], [["\u65b9\u4e00\u51e1", "\u65b9\u5706"], 1], [["\u65b9\u4e00\u51e1", "\u6797\u78ca\u513f"], 2], [["\u65b9\u4e00\u51e1", "\u7ae5\u6587\u6d01"], 2], [["\u65b9\u5706", "\u6797\u78ca\u513f"], 1], [["\u65b9\u5706", "\u7ae5\u6587\u6d01"], 3], [["\u6797\u78ca\u513f", "\u7ae5\u6587\u6d01"], 1], [["\u5218\u9759", "\u5b63\u6768\u6768"], 1], [["\u5218\u9759", "\u5b63\u80dc\u5229"], 2], [["\u5b63\u6768\u6768", "\u5b63\u80dc\u5229"], 5]], [[["\u52a9\u7406", "\u73cd\u59ae", "\u7ae5\u6587\u6d01"], 2], [["\u4e54\u536b\u4e1c", "\u4e54\u82f1\u5b50", "\u5b8b\u5029"], 1], [["\u4e54\u536b\u4e1c", "\u4e54\u82f1\u5b50", "\u65b9\u5706"], 1], [["\u4e54\u536b\u4e1c", "\u5b8b\u5029", "\u65b9\u5706"], 1], [["\u4e54\u82f1\u5b50", "\u5b8b\u5029", "\u65b9\u5706"], 1], [["\u5b8b\u5029", "\u65b9\u4e00\u51e1", "\u65b9\u5706"], 1], [["\u5b8b\u5029", "\u65b9\u4e00\u51e1", "\u6797\u78ca\u513f"], 1], [["\u5b8b\u5029", "\u65b9\u4e00\u51e1", "\u7ae5\u6587\u6d01"], 1], [["\u5b8b\u5029", "\u65b9\u5706", "\u6797\u78ca\u513f"], 1], [["\u5b8b\u5029", "\u65b9\u5706", "\u7ae5\u6587\u6d01"], 3], [["\u5b8b\u5029", "\u6797\u78ca\u513f", "\u7ae5\u6587\u6d01"], 1], [["\u65b9\u4e00\u51e1", "\u65b9\u5706", "\u6797\u78ca\u513f"], 1], [["\u65b9\u4e00\u51e1", "\u65b9\u5706", "\u7ae5\u6587\u6d01"], 1], [["\u65b9\u4e00\u51e1", "\u6797\u78ca\u513f", "\u7ae5\u6587\u6d01"], 1], [["\u65b9\u5706", "\u6797\u78ca\u513f", "\u7ae5\u6587\u6d01"], 1], [["\u5218\u9759", "\u5b63\u6768\u6768", "\u5b63\u80dc\u5229"], 1]], [[["\u4e54\u536b\u4e1c", "\u4e54\u82f1\u5b50", "\u5b8b\u5029", "\u65b9\u5706"], 1], [["\u5b8b\u5029", "\u65b9\u4e00\u51e1", "\u65b9\u5706", "\u6797\u78ca\u513f"], 1], [["\u5b8b\u5029", "\u65b9\u4e00\u51e1", "\u65b9\u5706", "\u7ae5\u6587\u6d01"], 1], [["\u5b8b\u5029", "\u65b9\u4e00\u51e1", "\u6797\u78ca\u513f", "\u7ae5\u6587\u6d01"], 1], [["\u5b8b\u5029", "\u65b9\u5706", "\u6797\u78ca\u513f", "\u7ae5\u6587\u6d01"], 1], [["\u65b9\u4e00\u51e1", "\u65b9\u5706", "\u6797\u78ca\u513f", "\u7ae5\u6587\u6d01"], 1]], [[["\u5b8b\u5029", "\u65b9\u4e00\u51e1", "\u65b9\u5706", "\u6797\u78ca\u513f", "\u7ae5\u6587\u6d01"], 1]]],
                7:[[[["\u65b9\u5706"], 6], [["\u7ae5\u6587\u6d01"], 10], [["\u5b8b\u5029"], 12], [["\u4e54\u82f1\u5b50"], 23], [["\u6797\u78ca\u513f"], 7], [["\u5b63\u6768\u6768"], 5], [["\u65b9\u4e00\u51e1"], 19], [["\u9ec4\u82b7\u9676"], 4], [["\u674e\u840c"], 1], [["\u4e54\u536b\u4e1c"], 7], [["\u5c0f\u68a6"], 3]], [[["\u5b8b\u5029", "\u65b9\u5706"], 1], [["\u5b8b\u5029", "\u7ae5\u6587\u6d01"], 1], [["\u65b9\u5706", "\u7ae5\u6587\u6d01"], 6], [["\u4e54\u82f1\u5b50", "\u6797\u78ca\u513f"], 4], [["\u4e54\u82f1\u5b50", "\u5b63\u6768\u6768"], 3], [["\u4e54\u82f1\u5b50", "\u65b9\u4e00\u51e1"], 9], [["\u4e54\u82f1\u5b50", "\u9ec4\u82b7\u9676"], 2], [["\u5b63\u6768\u6768", "\u65b9\u4e00\u51e1"], 5], [["\u5b63\u6768\u6768", "\u9ec4\u82b7\u9676"], 4], [["\u65b9\u4e00\u51e1", "\u9ec4\u82b7\u9676"], 4], [["\u4e54\u82f1\u5b50", "\u5b8b\u5029"], 10], [["\u4e54\u82f1\u5b50", "\u674e\u840c"], 1], [["\u5b8b\u5029", "\u674e\u840c"], 1], [["\u5b8b\u5029", "\u65b9\u4e00\u51e1"], 2], [["\u4e54\u536b\u4e1c", "\u4e54\u82f1\u5b50"], 4], [["\u4e54\u536b\u4e1c", "\u5c0f\u68a6"], 2], [["\u4e54\u82f1\u5b50", "\u5c0f\u68a6"], 1], [["\u4e54\u536b\u4e1c", "\u5b8b\u5029"], 2], [["\u65b9\u4e00\u51e1", "\u65b9\u5706"], 1], [["\u65b9\u4e00\u51e1", "\u7ae5\u6587\u6d01"], 3], [["\u65b9\u4e00\u51e1", "\u6797\u78ca\u513f"], 2], [["\u4e54\u536b\u4e1c", "\u65b9\u4e00\u51e1"], 1], [["\u65b9\u5706", "\u6797\u78ca\u513f"], 1], [["\u6797\u78ca\u513f", "\u7ae5\u6587\u6d01"], 1]], [[["\u5b8b\u5029", "\u65b9\u5706", "\u7ae5\u6587\u6d01"], 1], [["\u4e54\u82f1\u5b50", "\u5b63\u6768\u6768", "\u65b9\u4e00\u51e1"], 3], [["\u4e54\u82f1\u5b50", "\u5b63\u6768\u6768", "\u9ec4\u82b7\u9676"], 2], [["\u4e54\u82f1\u5b50", "\u65b9\u4e00\u51e1", "\u9ec4\u82b7\u9676"], 2], [["\u5b63\u6768\u6768", "\u65b9\u4e00\u51e1", "\u9ec4\u82b7\u9676"], 4], [["\u4e54\u82f1\u5b50", "\u5b8b\u5029", "\u674e\u840c"], 1], [["\u4e54\u82f1\u5b50", "\u5b8b\u5029", "\u65b9\u4e00\u51e1"], 2], [["\u4e54\u536b\u4e1c", "\u4e54\u82f1\u5b50", "\u5c0f\u68a6"], 1], [["\u65b9\u4e00\u51e1", "\u65b9\u5706", "\u7ae5\u6587\u6d01"], 1], [["\u4e54\u82f1\u5b50", "\u65b9\u4e00\u51e1", "\u6797\u78ca\u513f"], 1], [["\u4e54\u536b\u4e1c", "\u4e54\u82f1\u5b50", "\u5b8b\u5029"], 1], [["\u4e54\u536b\u4e1c", "\u4e54\u82f1\u5b50", "\u65b9\u4e00\u51e1"], 1], [["\u4e54\u536b\u4e1c", "\u5b8b\u5029", "\u65b9\u4e00\u51e1"], 1], [["\u65b9\u5706", "\u6797\u78ca\u513f", "\u7ae5\u6587\u6d01"], 1]], [[["\u4e54\u82f1\u5b50", "\u5b63\u6768\u6768", "\u65b9\u4e00\u51e1", "\u9ec4\u82b7\u9676"], 2], [["\u4e54\u536b\u4e1c", "\u4e54\u82f1\u5b50", "\u5b8b\u5029", "\u65b9\u4e00\u51e1"], 1]]],
            }
            */
    };
  },
  components: {
    MainChart
  },
  methods: {
    resizeEvent: function() {
      this.resizeFunc();
    },
    focus: function() {}
  },
  mounted: function() {
    this.resizeFunc = _.debounce(this.$refs.main_chart.resize, 500);
    this.resizeFunc();
    this.$parent.$on("resized", this.resizeEvent);
    this.$parent.$on("container-resized", this.resizeEvent);
  },
  watch: {
    SankeyData: function() {
      if (!this.loading) {
        this.resizeFunc();
        this.$refs.main_chart.dataFormat();
        this.$refs.main_chart.create_chart();
      }
    }
  }
};
</script>

