<template>
   
    <smart-widget title="剧情人物关系变化图">
        <Sankey v-bind:sdata="SankeyData" :edata=EpisodeData ref="sankey_chart"/>
        <!--<Sankey ref="sankey"/>-->
    </smart-widget>
</template>

<script>
import Sankey from "./Sankey";
import _ from "lodash";
export default {
    name:"SankeyBox",
    prop:{},
    data:function(){

        return{
            /*
            数据格式：
            EpisodeData:总集数
            SankeyData:{
                '1'：和FPS01_E01.json文件相同
                '2'：FPS01_E02.json文件
                ...
            }
            */
            EpisodeData:4,
            SankeyData:{
                1:[[[["方圆"], 4], [["童文洁"], 10], [["方一凡"], 14], [["校长"], 4], [["李萌"], 9], [["季杨杨"], 17], [["保安"], 4], [["黄芷陶"], 2], [["刘静"], 13], [["季胜利"], 6], [["刘铮"], 7], [["宋倩"], 5], [["乔英子"], 1], [["乔卫东"], 2]], [[["方圆", "童文洁"], 3], [["方一凡", "方圆"], 2], [["方一凡", "童文洁"], 5], [["李萌", "校长"], 1], [["季杨杨", "方一凡"], 9], [["季杨杨", "李萌"], 5], [["方一凡", "李萌"], 5], [["保安", "季杨杨"], 4], [["季杨杨", "黄芷陶"], 2], [["方一凡", "黄芷陶"], 2], [["刘静", "季杨杨"], 4], [["刘静", "李萌"], 3], [["刘静", "童文洁"], 3], [["季杨杨", "童文洁"], 1], [["李萌", "童文洁"], 4], [["刘静", "季胜利"], 4], [["季杨杨", "季胜利"], 1], [["刘铮", "刘静"], 5], [["刘铮", "季杨杨"], 2], [["刘铮", "季胜利"], 2], [["刘静", "宋倩"], 2], [["乔英子", "宋倩"], 1], [["乔卫东", "宋倩"], 2]], [[["方一凡", "方圆", "童文洁"], 2], [["季杨杨", "方一凡", "李萌"], 4], [["季杨杨", "方一凡", "黄芷陶"], 2], [["刘静", "季杨杨", "李萌"], 1], [["刘静", "季杨杨", "童文洁"], 1], [["刘静", "李萌", "童文洁"], 3], [["季杨杨", "李萌", "童文洁"], 1], [["方一凡", "李萌", "童文洁"], 1], [["刘静", "季杨杨", "季胜利"], 1], [["刘铮", "刘静", "季杨杨"], 2], [["刘铮", "刘静", "季胜利"], 2]], [[["刘静", "季杨杨", "李萌", "童文洁"], 1]]],
                2:[[[["乔卫东"], 15], [["乔英子"], 12], [["宋倩"], 16], [["保安"], 3], [["方一凡"], 13], [["童文洁"], 10], [["方圆"], 7], [["刘静"], 9], [["季杨杨"], 6], [["刘静母亲"], 1], [["季胜利"], 9], [["刘铮"], 1], [["黄芷陶"], 3], [["校长"], 3]], [[["乔卫东", "乔英子"], 7], [["乔卫东", "宋倩"], 8], [["乔英子", "宋倩"], 8], [["乔卫东", "保安"], 3], [["保安", "宋倩"], 1], [["宋倩", "方一凡"], 3], [["宋倩", "童文洁"], 5], [["方一凡", "童文洁"], 4], [["乔英子", "方一凡"], 2], [["乔卫东", "童文洁"], 3], [["乔英子", "童文洁"], 1], [["乔卫东", "方一凡"], 1], [["乔卫东", "方圆"], 3], [["方圆", "童文洁"], 5], [["宋倩", "方圆"], 2], [["刘静", "季杨杨"], 4], [["刘静母亲", "季杨杨"], 1], [["刘静母亲", "季胜利"], 1], [["季杨杨", "季胜利"], 3], [["刘铮", "刘静"], 1], [["刘铮", "季杨杨"], 1], [["刘铮", "季胜利"], 1], [["刘静", "季胜利"], 5], [["方一凡", "方圆"], 2], [["方一凡", "黄芷陶"], 2], [["乔卫东", "刘静"], 1], [["乔卫东", "季胜利"], 1], [["刘静", "宋倩"], 1], [["刘静", "方圆"], 1], [["刘静", "童文洁"], 1], [["季胜利", "宋倩"], 1], [["季胜利", "方圆"], 2], [["季胜利", "童文洁"], 2], [["季胜利", "校长"], 1], [["方一凡", "校长"], 1]], [[["乔卫东", "乔英子", "宋倩"], 4], [["乔卫东", "保安", "宋倩"], 1], [["宋倩", "方一凡", "童文洁"], 3], [["乔卫东", "乔英子", "童文洁"], 1], [["乔卫东", "宋倩", "童文洁"], 2], [["乔英子", "宋倩", "童文洁"], 1], [["乔卫东", "乔英子", "方一凡"], 1], [["乔卫东", "方圆", "童文洁"], 2], [["乔卫东", "宋倩", "方圆"], 2], [["刘静母亲", "季杨杨", "季胜利"], 1], [["刘铮", "刘静", "季杨杨"], 1], [["刘铮", "刘静", "季胜利"], 1], [["刘铮", "季杨杨", "季胜利"], 1], [["刘静", "季杨杨", "季胜利"], 1], [["方一凡", "方圆", "童文洁"], 1], [["乔卫东", "刘静", "季胜利"], 1], [["乔卫东", "刘静", "宋倩"], 1], [["乔卫东", "刘静", "方圆"], 1], [["乔卫东", "刘静", "童文洁"], 1], [["乔卫东", "季胜利", "宋倩"], 1], [["乔卫东", "季胜利", "方圆"], 1], [["乔卫东", "季胜利", "童文洁"], 1], [["刘静", "季胜利", "宋倩"], 1], [["刘静", "季胜利", "方圆"], 1], [["刘静", "季胜利", "童文洁"], 1], [["刘静", "宋倩", "方圆"], 1], [["刘静", "宋倩", "童文洁"], 1], [["刘静", "方圆", "童文洁"], 1], [["季胜利", "宋倩", "方圆"], 1], [["季胜利", "宋倩", "童文洁"], 1], [["季胜利", "方圆", "童文洁"], 2], [["宋倩", "方圆", "童文洁"], 1]], [[["乔卫东", "乔英子", "宋倩", "童文洁"], 1], [["刘铮", "刘静", "季杨杨", "季胜利"], 1], [["乔卫东", "刘静", "季胜利", "宋倩"], 1], [["乔卫东", "刘静", "季胜利", "方圆"], 1], [["乔卫东", "刘静", "季胜利", "童文洁"], 1], [["乔卫东", "刘静", "宋倩", "方圆"], 1], [["乔卫东", "刘静", "宋倩", "童文洁"], 1], [["乔卫东", "刘静", "方圆", "童文洁"], 1], [["乔卫东", "季胜利", "宋倩", "方圆"], 1], [["乔卫东", "季胜利", "宋倩", "童文洁"], 1], [["乔卫东", "季胜利", "方圆", "童文洁"], 1], [["乔卫东", "宋倩", "方圆", "童文洁"], 1], [["刘静", "季胜利", "宋倩", "方圆"], 1], [["刘静", "季胜利", "宋倩", "童文洁"], 1], [["刘静", "季胜利", "方圆", "童文洁"], 1], [["刘静", "宋倩", "方圆", "童文洁"], 1], [["季胜利", "宋倩", "方圆", "童文洁"], 1]], [[["乔卫东", "刘静", "季胜利", "宋倩", "方圆"], 1], [["乔卫东", "刘静", "季胜利", "宋倩", "童文洁"], 1], [["乔卫东", "刘静", "季胜利", "方圆", "童文洁"], 1], [["乔卫东", "刘静", "宋倩", "方圆", "童文洁"], 1], [["乔卫东", "季胜利", "宋倩", "方圆", "童文洁"], 1], [["刘静", "季胜利", "宋倩", "方圆", "童文洁"], 1]], [[["乔卫东", "刘静", "季胜利", "宋倩", "方圆", "童文洁"], 1]]],
                3:[[[["方圆"], 15], [["方一凡"], 15], [["童文洁"], 11], [["李萌"], 6], [["乔英子"], 8], [["季胜利"], 10], [["校长"], 2], [["乔卫东"], 4], [["宋倩"], 6], [["刘铮"], 6], [["季杨杨"], 8], [["刘静"], 4], [["黄芷陶"], 1]], [[["方一凡", "方圆"], 6], [["方一凡", "童文洁"], 4], [["方圆", "童文洁"], 6], [["方一凡", "李萌"], 5], [["乔英子", "方一凡"], 2], [["乔英子", "方圆"], 1], [["方圆", "李萌"], 1], [["季胜利", "方圆"], 8], [["季胜利", "校长"], 2], [["方圆", "校长"], 2], [["季胜利", "童文洁"], 5], [["乔卫东", "乔英子"], 2], [["乔卫东", "宋倩"], 3], [["乔英子", "宋倩"], 5], [["刘铮", "季杨杨"], 6], [["刘铮", "刘静"], 2], [["刘静", "季杨杨"], 3], [["刘铮", "季胜利"], 1], [["刘静", "季胜利"], 3], [["季杨杨", "季胜利"], 2], [["李萌", "童文洁"], 3], [["刘静", "方圆"], 1], [["刘静", "童文洁"], 2], [["季杨杨", "童文洁"], 1], [["乔英子", "黄芷陶"], 1], [["方一凡", "黄芷陶"], 1]], [[["方一凡", "方圆", "童文洁"], 1], [["乔英子", "方一凡", "方圆"], 1], [["方一凡", "方圆", "李萌"], 1], [["季胜利", "方圆", "校长"], 2], [["季胜利", "方圆", "童文洁"], 4], [["乔卫东", "乔英子", "宋倩"], 2], [["刘铮", "刘静", "季杨杨"], 2], [["刘铮", "刘静", "季胜利"], 1], [["刘铮", "季杨杨", "季胜利"], 1], [["刘静", "季杨杨", "季胜利"], 2], [["方一凡", "李萌", "童文洁"], 2], [["刘静", "季胜利", "方圆"], 1], [["刘静", "季胜利", "童文洁"], 2], [["刘静", "方圆", "童文洁"], 1], [["刘静", "季杨杨", "童文洁"], 1], [["季杨杨", "季胜利", "童文洁"], 1], [["乔英子", "方一凡", "黄芷陶"], 1]], [[["刘铮", "刘静", "季杨杨", "季胜利"], 1], [["刘静", "季胜利", "方圆", "童文洁"], 1], [["刘静", "季杨杨", "季胜利", "童文洁"], 1]]],
                4:[[[["方一凡"], 14], [["童文洁"], 18], [["方圆"], 9], [["林磊儿"], 11], [["刘静"], 12], [["季杨杨"], 9], [["刘铮"], 1], [["季胜利"], 9], [["方圆母亲"], 5], [["乔英子"], 4], [["宋倩"], 4]], [[["方一凡", "童文洁"], 11], [["方圆", "童文洁"], 7], [["林磊儿", "童文洁"], 8], [["方一凡", "方圆"], 5], [["刘静", "季杨杨"], 8], [["刘铮", "刘静"], 1], [["刘铮", "季杨杨"], 1], [["刘静", "季胜利"], 7], [["季杨杨", "季胜利"], 5], [["方一凡", "林磊儿"], 5], [["方圆", "林磊儿"], 4], [["方一凡", "方圆母亲"], 1], [["方圆", "方圆母亲"], 2], [["方圆母亲", "林磊儿"], 1], [["方圆母亲", "童文洁"], 3], [["乔英子", "宋倩"], 4]], [[["方一凡", "方圆", "童文洁"], 5], [["刘铮", "刘静", "季杨杨"], 1], [["刘静", "季杨杨", "季胜利"], 4], [["方一凡", "方圆", "林磊儿"], 2], [["方一凡", "林磊儿", "童文洁"], 5], [["方圆", "林磊儿", "童文洁"], 2], [["方一凡", "方圆", "方圆母亲"], 1], [["方一凡", "方圆母亲", "林磊儿"], 1], [["方一凡", "方圆母亲", "童文洁"], 1], [["方圆", "方圆母亲", "林磊儿"], 1], [["方圆", "方圆母亲", "童文洁"], 2], [["方圆母亲", "林磊儿", "童文洁"], 1]], [[["方一凡", "方圆", "林磊儿", "童文洁"], 2], [["方一凡", "方圆", "方圆母亲", "林磊儿"], 1], [["方一凡", "方圆", "方圆母亲", "童文洁"], 1], [["方一凡", "方圆母亲", "林磊儿", "童文洁"], 1], [["方圆", "方圆母亲", "林磊儿", "童文洁"], 1]], [[["方一凡", "方圆", "方圆母亲", "林磊儿", "童文洁"], 1]]],
            }
        };
    },
    components:{
        Sankey,
    },
    methods: {
    resizeEvent: function() {
      this.resizeFunc();
    }
  },
    mounted: function() {
        this.resizeFunc = _.debounce(this.$refs.sankey_chart.chart.resize, 500);
        this.resizeFunc();
        this.$parent.$on("resize", this.resizeEvent); 
    }
}



            
</script>

